Revit 2024 API
BuiltInFailures.CreationFailures.CannotMakeSurfaceError Property
 Can't construct surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotMakeSurfaceError { get; }
Visual Basic
Public Shared ReadOnly Property CannotMakeSurfaceError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotMakeSurfaceError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace